mtiutiu/Coding_Playground/sensors_network/project/esp8266_mqtt/ws2812fx_node/src/main.cpp
  uint8_t modeSetting = loadState(RGB_STRIP_MODE_EEPROM_SAVE_LOCATION_ID);
  ws2812fx.setMode(((modeSetting >= MODE_MIN_VALUE) &&
                    (modeSetting <= ws2812fx.getModeCount()))
                       ? modeSetting
                       : MODE_DEFAULT_VALUE);

  uint8_t R_FieldColorSetting =
      loadState(RGB_STRIP_R_COLOR_EEPROM_SAVE_LOCATION_ID);
  uint8_t G_FieldColorSetting =
      loadState(RGB_STRIP_G_COLOR_EEPROM_SAVE_LOCATION_ID);
  uint8_t B_FieldColorSetting =
      loadState(RGB_STRIP_B_COLOR_EEPROM_SAVE_LOCATION_ID);
  ws2812fx.setColor(((R_FieldColorSetting >= R_COLOR_FIELD_MIN_VALUE) &&
                     (R_FieldColorSetting <= R_COLOR_FIELD_MAX_VALUE))
                        ? R_FieldColorSetting
                        : R_COLOR_FIELD_DEFAULT_VALUE,
                    ((G_FieldColorSetting >= G_COLOR_FIELD_MIN_VALUE) &&
                     (G_FieldColorSetting <= G_COLOR_FIELD_MAX_VALUE))
                        ? G_FieldColorSetting
                        : G_COLOR_FIELD_DEFAULT_VALUE,
                    ((B_FieldColorSetting >= B_COLOR_FIELD_MIN_VALUE) &&
                     (B_FieldColorSetting <= B_COLOR_FIELD_MAX_VALUE))
                        ? B_FieldColorSetting
                        : B_COLOR_FIELD_DEFAULT_VALUE);
  ws2812fx.trigger();
}

void sendLedStripState() {
  char reply[MQTT_MAX_PAYLOAD_LENGTH];

  snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "%02x%02x%02x",
           (uint8_t)((ws2812fx.getColor() & 0x00FF0000) >> 16),
           (uint8_t)((ws2812fx.getColor() & 0x0000FF00) >> 8),
           (uint8_t)((ws2812fx.getColor() & 0x000000FF) >> 0));
  mysNode.send(RGB_SENSOR_ID, V_RGB, reply);
  // wait(SUCCESSIVE_SENSOR_DATA_SEND_DELAY_MS);

  uint8_t currentLedStripBrightness =
      round((float)(ws2812fx.getBrightness() * 100) / BRIGHTNESS_MAX_VALUE);
  snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "%d", currentLedStripBrightness);
  mysNode.send(RGB_SENSOR_ID, V_LIGHT_LEVEL, reply);
  // wait(SUCCESSIVE_SENSOR_DATA_SEND_DELAY_MS);

  uint8_t currentLedStripSpeed =
      round((float)(ws2812fx.getSpeed() * 100) / SPEED_MAX_VALUE);
  snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "%d", currentLedStripSpeed);
  mysNode.send(RGB_SENSOR_ID, V_PERCENTAGE, reply);
  // wait(SUCCESSIVE_SENSOR_DATA_SEND_DELAY_MS);

  uint8_t currentLedStripMode = ws2812fx.getMode();
  snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "%d", currentLedStripMode);
  mysNode.send(RGB_SENSOR_ID, V_CUSTOM, reply);
  // wait(SUCCESSIVE_SENSOR_DATA_SEND_DELAY_MS);

  uint8_t currentLedStripState = ws2812fx.isRunning();
  snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "%d", currentLedStripState);
  mysNode.send(RGB_SENSOR_ID, V_STATUS, reply);
}

// callback notifying us of the need to save config
void saveConfigCallback() {
  configurationUpdated = true;
}

CfgData& loadConfig(const char *cfgFilePath) {
  static CfgData data;

  if (SPIFFS.begin()) {
    if (SPIFFS.exists(cfgFilePath)) {
      File configFile = SPIFFS.open(cfgFilePath, "r");
      if (configFile) {
// read config file
#ifdef DEBUG
        DEBUG_OUTPUT.println("Config file found!");
#endif

        size_t size = configFile.size();
        // Allocate a buffer to store contents of the file.
        std::unique_ptr<char[]> buf(new char[size]);
        configFile.readBytes(buf.get(), size);
        configFile.close();

        StaticJsonBuffer<512> jsonBuffer;
        JsonObject &json = jsonBuffer.parseObject(buf.get());
#ifdef DEBUG
        json.printTo(Serial);
        Serial.println();
#endif

        strncpy(data.mqtt_server, json["mqtt_server"],
                MQTT_SERVER_FIELD_MAX_LEN);
        strncpy(data.mqtt_user, json["mqtt_user"], MQTT_USER_FIELD_MAX_LEN);
        strncpy(data.mqtt_passwd, json["mqtt_passwd"], MQTT_PASS_FIELD_MAX_LEN);
        strncpy(data.mqtt_port, json["mqtt_port"], MQTT_PORT_FIELD_MAX_LEN);
        strncpy(data.mqtt_in_topic_prefix, json["mqtt_in_topic_prefix"],
                MQTT_IN_TOPIC_PREFIX_FIELD_MAX_LEN);
        strncpy(data.mqtt_out_topic_prefix, json["mqtt_out_topic_prefix"],
                MQTT_OUT_TOPIC_PREFIX_FIELD_MAX_LEN);
        strncpy(data.mys_node_id, json["mys_node_id"],
                MYS_NODE_ID_FIELD_MAX_LEN);
        strncpy(data.mys_node_alias, json["mys_node_alias"],
                MYS_NODE_ALIAS_FIELD_MAX_LEN);
        strncpy(data.mys_node_led_count, json["mys_node_led_count"],
                MYS_NODE_LED_COUNT_FIELD_MAX_LEN);

      } else {
// config file couldn't be opened
#ifdef DEBUG
        DEBUG_OUTPUT.println("Config file couldn't be opened!");
#endif
      }
    } else {
// config file not found start portal
#ifdef DEBUG
      DEBUG_OUTPUT.println("Config file wasn't found!");
#endif
      // startCustomCaptivePortal();
    }
    SPIFFS.end();
  } else {
// fail to mount spiffs
#ifdef DEBUG
    DEBUG_OUTPUT.println("SPIFFS mount failed!");
#endif
  }

  return data;
}

void saveConfig(const char *cfgFilePath, CfgData &data) {
  if (SPIFFS.begin()) {
    if (SPIFFS.exists(cfgFilePath)) {
      File configFile = SPIFFS.open(cfgFilePath, "w");
      if (configFile) {
// read config file
#ifdef DEBUG
        DEBUG_OUTPUT.println("Config file found!");
#endif

        StaticJsonBuffer<512> jsonBuffer;
        JsonObject &json = jsonBuffer.createObject();

        json["mqtt_server"] = data.mqtt_server;
        json["mqtt_user"] = data.mqtt_user;
        json["mqtt_passwd"] = data.mqtt_passwd;
        json["mqtt_port"] = data.mqtt_port;
        json["mqtt_in_topic_prefix"] = data.mqtt_in_topic_prefix;
        json["mqtt_out_topic_prefix"] = data.mqtt_out_topic_prefix;
        json["mys_node_id"] = data.mys_node_id;
        json["mys_node_alias"] = data.mys_node_alias;
        json["mys_node_led_count"] = data.mys_node_led_count;

        json.printTo(configFile);
        configFile.close();
      } else {
// config file couldn't be opened
#ifdef DEBUG
        DEBUG_OUTPUT.println("Config file couldn't be opened!");
#endif
      }
    } else {
// config file not found start portal
#ifdef DEBUG
      DEBUG_OUTPUT.println("Config file wasn't found!");
#endif
    }
    SPIFFS.end();
  } else {
// fail to mount spiffs
#ifdef DEBUG
    DEBUG_OUTPUT.println("SPIFFS mount failed!");
#endif
  }
}

