mtiutiu/Coding_Playground/sensors_network/project/esp8266_mqtt/ws2812fx_node/src/main.cpp
void onWiFiConfigPostHook(CfgData& cfgData) {
  // update led strip data after wifi config finished
  // led strip init
  // very important - set led count and pixel buffer first
  uint16_t ledCount = (uint16_t)atoi(cfgData.mys_node_led_count);
#ifdef DEBUG
  Serial.printf("We have %d leds ...\r\n", ledCount);
#endif
  ws2812fx.setPixels(ws2812fx.setLedCount(ledCount), pix_buff);
  ws2812fx.init();
}

void startWiFiConfig(CfgData &cfgData, bool onDemand = false,
                      cb wifiPostConfigCallback = NULL) {
  // custom parameters
  WiFiManagerParameter mqtt_header_text("<br/><b>MQTT</b>");
  WiFiManagerParameter custom_mqtt_server(
      "server", "mqtt server", cfgData.mqtt_server, MQTT_SERVER_FIELD_MAX_LEN);
  WiFiManagerParameter custom_mqtt_server_user(
      "user", "mqtt user", cfgData.mqtt_user, MQTT_USER_FIELD_MAX_LEN);
  WiFiManagerParameter custom_mqtt_server_passwd(
      "passwd", "mqtt passwd", cfgData.mqtt_passwd, MQTT_PASS_FIELD_MAX_LEN);
  WiFiManagerParameter custom_mqtt_port("port", "mqtt port", cfgData.mqtt_port,
                                        MQTT_PORT_FIELD_MAX_LEN,
                                        "min=\"1\" max=\"65535\"");
  WiFiManagerParameter custom_mqtt_in_topic_prefix(
      "in_topic_prefix", "mqtt in topic prefix", cfgData.mqtt_in_topic_prefix,
      MQTT_IN_TOPIC_PREFIX_FIELD_MAX_LEN);
  WiFiManagerParameter custom_mqtt_out_topic_prefix(
      "out_topic_prefix", "mqtt out topic prefix",
      cfgData.mqtt_out_topic_prefix, MQTT_OUT_TOPIC_PREFIX_FIELD_MAX_LEN);

  WiFiManagerParameter mys_header_text("<br/><br/><b>MySensors</b>");
  WiFiManagerParameter custom_mys_node_id(
      "node_id", "node id", cfgData.mys_node_id, MYS_NODE_ID_FIELD_MAX_LEN,
      "min=\"1\" max=\"254\"");
  WiFiManagerParameter custom_mys_node_alias("node_alias", "node alias",
                                             cfgData.mys_node_alias,
                                             MYS_NODE_ALIAS_FIELD_MAX_LEN);
  WiFiManagerParameter custom_mys_node_led_count(
      "node_led_count", "led count", cfgData.mys_node_led_count,
      MYS_NODE_LED_COUNT_FIELD_MAX_LEN, "min=\"1\" max=\"" xstr(MAX_LED_COUNT) "\"");

  WiFiManager wifiManager;
  wifiManager.setSaveConfigCallback(saveConfigCallback);

  wifiManager.addParameter(&mqtt_header_text);
  wifiManager.addParameter(&custom_mqtt_server);
  wifiManager.addParameter(&custom_mqtt_server_user);
  wifiManager.addParameter(&custom_mqtt_server_passwd);
  wifiManager.addParameter(&custom_mqtt_port);
  wifiManager.addParameter(&custom_mqtt_in_topic_prefix);
  wifiManager.addParameter(&custom_mqtt_out_topic_prefix);

  wifiManager.addParameter(&mys_header_text);
  wifiManager.addParameter(&custom_mys_node_id);
  wifiManager.addParameter(&custom_mys_node_alias);
  wifiManager.addParameter(&custom_mys_node_led_count);

  if (onDemand) {
#ifdef DEBUG
    DEBUG_OUTPUT.println(
        "Resetting settings and starting on demand WiFi config portal ...");
#endif
    wifiManager.resetSettings();
    wifiManager.startConfigPortal(AP_SSID, AP_PASSWD);
  } else {
#ifdef DEBUG
    DEBUG_OUTPUT.printf(
        "Starting WiFi autoconfig portal with %lus timeout...\r\n",
        CFG_PORTAL_TIMEOUT_S);
#endif
    wifiManager.setTimeout(CFG_PORTAL_TIMEOUT_S);
    if (!wifiManager.autoConnect(AP_SSID, AP_PASSWD)) {
#ifdef DEBUG
      DEBUG_OUTPUT.println("Failed to connect and configuration portal timeout "
                           "was reached, rebooting ...");
#endif
      // fail to connect
      delay(1000);
      // reset and try again, or maybe put it to deep sleep
      ESP.restart();
    }
  }

  if (configurationUpdated) {
#ifdef DEBUG
    DEBUG_OUTPUT.println("Configuration changed need to save it!");
#endif

    strncpy(cfgData.mqtt_server, custom_mqtt_server.getValue(),
            MQTT_SERVER_FIELD_MAX_LEN);
    strncpy(cfgData.mqtt_user, custom_mqtt_server_user.getValue(),
            MQTT_USER_FIELD_MAX_LEN);
    strncpy(cfgData.mqtt_passwd, custom_mqtt_server_passwd.getValue(),
            MQTT_PASS_FIELD_MAX_LEN);
    strncpy(cfgData.mqtt_port, custom_mqtt_port.getValue(),
            MQTT_PORT_FIELD_MAX_LEN);
    strncpy(cfgData.mqtt_in_topic_prefix,
            custom_mqtt_in_topic_prefix.getValue(),
            MQTT_IN_TOPIC_PREFIX_FIELD_MAX_LEN);
    strncpy(cfgData.mqtt_out_topic_prefix,
            custom_mqtt_out_topic_prefix.getValue(),
            MQTT_OUT_TOPIC_PREFIX_FIELD_MAX_LEN);
    strncpy(cfgData.mys_node_id, custom_mys_node_id.getValue(),
            MYS_NODE_ID_FIELD_MAX_LEN);
    strncpy(cfgData.mys_node_alias, custom_mys_node_alias.getValue(),
            MYS_NODE_ALIAS_FIELD_MAX_LEN);
    strncpy(cfgData.mys_node_led_count, custom_mys_node_led_count.getValue(),
            MYS_NODE_LED_COUNT_FIELD_MAX_LEN);

    // save new cfg data
    saveConfig(CONFIG_FILE, cfgData);

    if(wifiPostConfigCallback) {
      wifiPostConfigCallback(cfgData);
    }

    configurationUpdated = false;
  }
}

void onMessage(MySensorMsg &message) {
  char reply[MQTT_MAX_PAYLOAD_LENGTH];

  if (message.cmd_type == M_SET) {
    if (strlen(message.payload) > 0) {
#ifdef DEBUG
      DEBUG_OUTPUT.printf("Received M_SET command with value: %s\r\n",
                          message.payload);
#endif
      if (message.sub_type == V_RGB) {
        if (!ws2812fx.isRunning()) {
          return;
        }

        ws2812fx.setColor(strtoul(message.payload, NULL, 16));
        ws2812fx.trigger();
        mysNode.send(RGB_SENSOR_ID, V_RGB, message.payload);
      } else if (message.sub_type == V_LIGHT_LEVEL) {
        if (!ws2812fx.isRunning()) {
          return;
        }

        uint16_t brightnessPercentage = (uint16_t)atoi(message.payload);
        if ((brightnessPercentage >= 0) && (brightnessPercentage <= 100)) {
          ws2812fx.setBrightness(round(
              (float)(brightnessPercentage * BRIGHTNESS_MAX_VALUE) / 100));
          ws2812fx.trigger();
          snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "%d", brightnessPercentage);
          mysNode.send(RGB_SENSOR_ID, V_LIGHT_LEVEL, reply);
        }
      } else if (message.sub_type == V_PERCENTAGE) {
        if (!ws2812fx.isRunning()) {
          return;
        }

        uint16_t speedPercentage = (uint16_t)atoi(message.payload);
        if ((speedPercentage >= 0) && (speedPercentage <= 100)) {
          ws2812fx.setSpeed(
              round((float)(speedPercentage * SPEED_MAX_VALUE) / 100));
          ws2812fx.trigger();
          snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "%d", speedPercentage);
          mysNode.send(RGB_SENSOR_ID, V_PERCENTAGE, reply);
        }
      } else if (message.sub_type == V_CUSTOM) {
        if (!ws2812fx.isRunning()) {
          return;
        }

        uint16_t modeSetting = (uint16_t)atoi(message.payload);
        if ((modeSetting >= MODE_MIN_VALUE) &&
            (modeSetting < ws2812fx.getModeCount())) {
          ws2812fx.setMode(modeSetting);
          ws2812fx.trigger();
          snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "%d", modeSetting);
          mysNode.send(RGB_SENSOR_ID, V_CUSTOM, reply);
        }
      } else if (message.sub_type == V_STATUS) {
        uint16_t newLedStripState = (uint16_t)atoi(message.payload);
        if ((newLedStripState == OFF) && (ws2812fx.isRunning())) {
          // get current brightness/color settings for saving them later
          uint8_t previousLedStripBrightness = ws2812fx.getBrightness();
          uint32_t previousLedStripColor = ws2812fx.getColor();

          // turn OFF rgb led strip
          ws2812fx.stop();
          digitalWrite(LED_STRIP_DATA_PIN, LOW);

          saveRGBLedStripCurrentSettings(
              previousLedStripBrightness, ws2812fx.getSpeed(),
              ws2812fx.getMode(), previousLedStripColor);
        }

