mtiutiu/Coding_Playground/sensors_network/project/esp8266_mqtt/ws2812fx_node/src/main.cpp
        if ((newLedStripState == ON) && (!ws2812fx.isRunning())) {
          // load rgb led strip saved settings
          loadRGBLedStripSavedSettings();
          ws2812fx.start();
          sendLedStripState();
        }
      }
    }
  }

  /*if(message.cmd_type == M_REQ) {
  #ifdef DEBUG
    DEBUG_OUTPUT.println("Received M_REQ command");
  #endif
  }*/
}

void checkTransportConnection() {
  if (!mysNode.connected()) {
    digitalWrite(LED_SIGNAL_PIN, !digitalRead(LED_SIGNAL_PIN));
  }

// make sure signaling led is off if transport is connected
#ifdef INVERSE_LED_LOGIC
  if (mysNode.connected() && !digitalRead(LED_SIGNAL_PIN)) {
    digitalWrite(LED_SIGNAL_PIN, HIGH);
  }
#else
  if (mysNode.connected() && digitalRead(LED_SIGNAL_PIN)) {
    digitalWrite(LED_SIGNAL_PIN, LOW);
  }
#endif
}

void sendBatteryLevel() {
  uint8_t vccPercent = round((ESP.getVcc() * 100) / VDD_VOLTAGE_MV);
#ifdef DEBUG
  DEBUG_OUTPUT.printf("Sending system voltage level: %d%%\r\n", vccPercent);
#endif
  mysNode.send_battery_level(vccPercent);
}

void sendRSSILevel() {
  char reply[MQTT_MAX_PAYLOAD_LENGTH];
// mycontroller supports this for now
#ifdef DEBUG
  DEBUG_OUTPUT.printf("Sending RSSI level: %d ...\r\n", WiFi.RSSI());
#endif
  snprintf(reply, MQTT_MAX_PAYLOAD_LENGTH, "rssi:%d dBm", WiFi.RSSI());
  mysNode.send(1, V_VAR5, reply);
}

void sendSensorState() {
  sendLedStripState();
}

void sendReports() {
  sendSensorState();
  sendBatteryLevel();
  sendRSSILevel();
}

void ledStripUpdate() {
  if (ws2812fx.isRunning()) {
    ws2812fx.service();
  }
}

void portsConfig() {
  pinMode(LED_SIGNAL_PIN, OUTPUT);
  pinMode(ERASE_CONFIG_BTN_PIN,
#ifdef ERASE_CFG_BTN_INVERSE_LOGIC
          INPUT
#else
          INPUT_PULLUP
#endif
          );

  digitalWrite(LED_SIGNAL_PIN,
#ifdef INVERSE_LED_LOGIC
               HIGH
#else
               LOW
#endif
               );
}

void ledStripInit(CfgData& cfgData) {
  // led strip init
  // very important - set led count and pixel buffer first
  uint16_t ledCount = (uint16_t)atoi(cfgData.mys_node_led_count);
#ifdef DEBUG
  Serial.printf("We have %d leds ...\r\n", ledCount);
#endif
  ws2812fx.setPixels(ws2812fx.setLedCount(ledCount), pix_buff);
  ws2812fx.init();

  // load rgb led strip saved settings
  loadRGBLedStripSavedSettings();

  // start led strip in OFF state
  ws2812fx.stop();
  digitalWrite(LED_STRIP_DATA_PIN, LOW);

  ledStripUpdateTicker.attach(LED_STRIP_UPDATE_INTERVAL_S, ledStripUpdate);
}

void nodeConfig(CfgData& cfgData) {
  // transport connection signaling
  // enabling this before WiFiManager in order to have visual feedback ASAP
  noTransportLedTicker.attach(NOT_CONNECTED_SIGNALING_INTERVAL_S,
                              checkTransportConnection);

#ifdef DEBUG
  DEBUG_OUTPUT.println();
  DEBUG_OUTPUT.println("=== CONFIG FILE DATA ===");
  DEBUG_OUTPUT.print("MQTT SERVER: ");
  DEBUG_OUTPUT.println(cfgData.mqtt_server);
  DEBUG_OUTPUT.print("MQTT USER: ");
  DEBUG_OUTPUT.println(cfgData.mqtt_user);
  DEBUG_OUTPUT.print("MQTT PASSWORD: ");
  DEBUG_OUTPUT.println(cfgData.mqtt_passwd);
  DEBUG_OUTPUT.print("MQTT PORT: ");
  DEBUG_OUTPUT.println(cfgData.mqtt_port);
#endif

  // pressing erase config button and then pressing-releasing the reset button
  //  will erase wifi data and starts on demand portal
  // get reset cause first
  bool isExternalReset = (ESP.getResetInfoPtr()->reason == REASON_EXT_SYS_RST);
  startWiFiConfig(cfgData, isExternalReset &&
#ifdef ERASE_CFG_BTN_INVERSE_LOGIC
                               digitalRead(ERASE_CONFIG_BTN_PIN),
#else
                               !digitalRead(ERASE_CONFIG_BTN_PIN),
#endif
                  onWiFiConfigPostHook);
}

void mySensorsInit(CfgData& cfgData) {
  mysNode.begin(atoi(cfgData.mys_node_id),
                cfgData.mys_node_alias,
                CHILD_TYPES,
                CHILD_ALIASES,
                SENSOR_COUNT,
                cfgData.mqtt_server,
                cfgData.mqtt_user,
                cfgData.mqtt_passwd,
                atoi(cfgData.mqtt_port),
                cfgData.mqtt_in_topic_prefix,
                cfgData.mqtt_out_topic_prefix);
  mysNode.on_message(onMessage);
}

void reportersInit() {
  batteryLevelReportTicker.attach(BATTER_LVL_REPORT_INTERVAL_S,
                                  sendBatteryLevel);
  signalLevelReportTicker.attach(RSSI_LVL_REPORT_INTERVAL_S, sendRSSILevel);
  sensorStateReportTicker.attach(SENSOR_STATE_REPORT_INTERVAL_S,
                                 sendSensorState);
}

void setup() {
#ifdef DEBUG
  DEBUG_OUTPUT.begin(SERIAL_DEBUG_BAUDRATE);
#endif

  // pre inits
  MySensorsEEPROM::hwInit();
  CfgData& cfgData = loadConfig(CONFIG_FILE);

  portsConfig();
  ledStripInit(cfgData);
  nodeConfig(cfgData);
  mySensorsInit(cfgData);
  reportersInit();

  // send initial reports on node startup
  if (mysNode.connected()) {
    sendReports();
  }
}

void loop() {
  mysNode.loop();

  static bool needToSendReports = false;
  if (!mysNode.connected()) {
    needToSendReports = true;
  }

  if (mysNode.connected() && needToSendReports) {
    // send reports on node reconnection
    sendReports();
    needToSendReports = false;
  }
}
